In [1]:
import polars as pl
import pandas as pd
import modin.pandas as mpd
import numpy as np
from distributed import Client

client = Client()

In [2]:
pl.show_versions()

--------Version info---------
Polars:              0.19.1
Index type:          UInt32
Platform:            Windows-10-10.0.22621-SP0
Python:              3.11.3 | packaged by Anaconda, Inc. | (main, Apr 19 2023, 23:46:34) [MSC v.1916 64 bit (AMD64)]

----Optional dependencies----
adbc_driver_sqlite:  <not installed>
cloudpickle:         2.2.1
connectorx:          0.3.2
deltalake:           <not installed>
fsspec:              2023.3.0
matplotlib:          3.7.1
numpy:               1.24.3
pandas:              2.0.3
pyarrow:             11.0.0
pydantic:            <not installed>
sqlalchemy:          1.4.39
xlsx2csv:            0.8.1
xlsxwriter:          3.1.2

In [3]:
file_path = r"D:\VED\Polars\notebooks\data\nyc_trip_data_1k.csv"

In [4]:
%%time
pl.scan_csv(file_path,try_parse_dates=True).head().collect()

CPU times: total: 0 ns
Wall time: 16.6 ms

shape: (5, 7)
┌──────────┬─────────────────────┬─────────────────────┬─────────────────┬───────────────┬─────────────┬────────────┐
│ VendorID ┆ pickup              ┆ dropoff             ┆ passenger_count ┆ trip_distance ┆ fare_amount ┆ tip_amount │
│ ---      ┆ ---                 ┆ ---                 ┆ ---             ┆ ---           ┆ ---         ┆ ---        │
│ str      ┆ datetime[μs]        ┆ datetime[μs]        ┆ f64             ┆ f64           ┆ f64         ┆ f64        │
╞══════════╪═════════════════════╪═════════════════════╪═════════════════╪═══════════════╪═════════════╪════════════╡
│ id1      ┆ 2022-01-01 00:04:14 ┆ 2022-01-01 00:26:12 ┆ 1.0             ┆ 10.83         ┆ 31.0        ┆ 0.0        │
│ id2      ┆ 2022-01-01 00:32:17 ┆ 2022-01-01 00:49:23 ┆ 1.0             ┆ 3.97          ┆ 14.5        ┆ 3.66       │
│ id8      ┆ 2022-01-01 00:40:58 ┆ 2022-01-01 01:00:59 ┆ 4.0             ┆ 8.44          ┆ 25.5        ┆ 0.0        │
│ id0      ┆ 2022-01-01 00:55:13 ┆ 2022-01-01 01:25:49 ┆ 1.0             ┆ 12.61         ┆ 37.5        ┆ 12.39      │
│ id1      ┆ 2022-01-01 00:55:24 ┆ 2022-01-01 01:00:45 ┆ 1.0             ┆ 1.49          ┆ 6.5         ┆ 0.0        │
└──────────┴─────────────────────┴─────────────────────┴─────────────────┴───────────────┴─────────────┴────────────┘

In [6]:
%%time
pd.read_csv(file_path,parse_dates=True).head()

CPU times: total: 0 ns
Wall time: 11.8 ms

,VendorID,pickup,dropoff,passenger_count,trip_distance,fare_amount,tip_amount
0,id1,2022-01-01T00:04:14.000000,2022-01-01T00:26:12.000000,1.0,10.83,31.0,0.00
1,id2,2022-01-01T00:32:17.000000,2022-01-01T00:49:23.000000,1.0,3.97,14.5,3.66
2,id8,2022-01-01T00:40:58.000000,2022-01-01T01:00:59.000000,4.0,8.44,25.5,0.00
3,id0,2022-01-01T00:55:13.000000,2022-01-01T01:25:49.000000,1.0,12.61,37.5,12.39
4,id1,2022-01-01T00:55:24.000000,2022-01-01T01:00:45.000000,1.0,1.49,6.5,0.00

In [7]:
%%time
pd.read_csv(file_path,parse_dates=True,engine='pyarrow').head()

CPU times: total: 0 ns
Wall time: 81.6 ms

,VendorID,pickup,dropoff,passenger_count,trip_distance,fare_amount,tip_amount
0,id1,2022-01-01 00:04:14,2022-01-01 00:26:12,1.0,10.83,31.0,0.00
1,id2,2022-01-01 00:32:17,2022-01-01 00:49:23,1.0,3.97,14.5,3.66
2,id8,2022-01-01 00:40:58,2022-01-01 01:00:59,4.0,8.44,25.5,0.00
3,id0,2022-01-01 00:55:13,2022-01-01 01:25:49,1.0,12.61,37.5,12.39
4,id1,2022-01-01 00:55:24,2022-01-01 01:00:45,1.0,1.49,6.5,0.00

In [8]:
%%time
mpd.read_csv(file_path,parse_dates=True).head()

CPU times: total: 15.6 ms
Wall time: 445 ms

,VendorID,pickup,dropoff,passenger_count,trip_distance,fare_amount,tip_amount
0,id1,2022-01-01T00:04:14.000000,2022-01-01T00:26:12.000000,1.0,10.83,31.0,0.00
1,id2,2022-01-01T00:32:17.000000,2022-01-01T00:49:23.000000,1.0,3.97,14.5,3.66
2,id8,2022-01-01T00:40:58.000000,2022-01-01T01:00:59.000000,4.0,8.44,25.5,0.00
3,id0,2022-01-01T00:55:13.000000,2022-01-01T01:25:49.000000,1.0,12.61,37.5,12.39
4,id1,2022-01-01T00:55:24.000000,2022-01-01T01:00:45.000000,1.0,1.49,6.5,0.00

In [14]:
%%time
df_pd = pd.read_csv(file_path,parse_dates=True).groupby("passenger_count").agg({"fare_amount":"mean"})

CPU times: total: 0 ns
Wall time: 6.66 ms

In [13]:
%%time
df_pl = pl.scan_csv(file_path,try_parse_dates=True).group_by("passenger_count").agg(
[pl.col("fare_amount").mean()])

CPU times: total: 0 ns
Wall time: 4.29 ms

In [15]:
%%time
df_pd = pd.read_csv(file_path,parse_dates=True,engine='pyarrow').groupby("passenger_count").agg({"fare_amount":"mean"})

CPU times: total: 0 ns
Wall time: 7.05 ms

In [16]:
titanic_file = r"D:\VED\Polars\notebooks\data\titanic.csv"

In [17]:
%%time
titanic_pl_df = pl.read_csv(titanic_file)

CPU times: total: 0 ns
Wall time: 17.1 ms

In [18]:
titanic_pl_df.head()

shape: (5, 12)
┌─────────────┬──────────┬────────┬────────────────────────────────┬───┬──────────────────┬─────────┬───────┬──────────┐
│ PassengerId ┆ Survived ┆ Pclass ┆ Name                           ┆ … ┆ Ticket           ┆ Fare    ┆ Cabin ┆ Embarked │
│ ---         ┆ ---      ┆ ---    ┆ ---                            ┆   ┆ ---              ┆ ---     ┆ ---   ┆ ---      │
│ i64         ┆ i64      ┆ i64    ┆ str                            ┆   ┆ str              ┆ f64     ┆ str   ┆ str      │
╞═════════════╪══════════╪════════╪════════════════════════════════╪═══╪══════════════════╪═════════╪═══════╪══════════╡
│ 1           ┆ 0        ┆ 3      ┆ Braund, Mr. Owen Harris        ┆ … ┆ A/5 21171        ┆ 7.25    ┆ null  ┆ S        │
│ 2           ┆ 1        ┆ 1      ┆ Cumings, Mrs. John Bradley     ┆ … ┆ PC 17599         ┆ 71.2833 ┆ C85   ┆ C        │
│             ┆          ┆        ┆ (Flor…                         ┆   ┆                  ┆         ┆       ┆          │
│ 3           ┆ 1        ┆ 3      ┆ Heikkinen, Miss. Laina         ┆ … ┆ STON/O2. 3101282 ┆ 7.925   ┆ null  ┆ S        │
│ 4           ┆ 1        ┆ 1      ┆ Futrelle, Mrs. Jacques Heath   ┆ … ┆ 113803           ┆ 53.1    ┆ C123  ┆ S        │
│             ┆          ┆        ┆ (Li…                           ┆   ┆                  ┆         ┆       ┆          │
│ 5           ┆ 0        ┆ 3      ┆ Allen, Mr. William Henry       ┆ … ┆ 373450           ┆ 8.05    ┆ null  ┆ S        │
└─────────────┴──────────┴────────┴────────────────────────────────┴───┴──────────────────┴─────────┴───────┴──────────┘

In [19]:
type(titanic_pl_df)

polars.dataframe.frame.DataFrame

In [20]:
titanic_pl_df.schema

{'PassengerId': Int64,
 'Survived': Int64,
 'Pclass': Int64,
 'Name': Utf8,
 'Sex': Utf8,
 'Age': Float64,
 'SibSp': Int64,
 'Parch': Int64,
 'Ticket': Utf8,
 'Fare': Float64,
 'Cabin': Utf8,
 'Embarked': Utf8}

In [21]:
titanic_pl_df.dtypes

[Int64,
 Int64,
 Int64,
 Utf8,
 Utf8,
 Float64,
 Int64,
 Int64,
 Utf8,
 Float64,
 Utf8,
 Utf8]

In [22]:
titanic_pl_df['Name'].dtype

Utf8

In [23]:
titanic_pl_df.to_arrow()

pyarrow.Table
PassengerId: int64
Survived: int64
Pclass: int64
Name: large_string
Sex: large_string
Age: double
SibSp: int64
Parch: int64
Ticket: large_string
Fare: double
Cabin: large_string
Embarked: large_string
----
PassengerId: [[1,2,3,4,5,...,887,888,889,890,891]]
Survived: [[0,1,1,1,0,...,0,1,0,1,0]]
Pclass: [[3,1,3,1,3,...,2,1,3,1,3]]
Name: [["Braund, Mr. Owen Harris","Cumings, Mrs. John Bradley (Florence Briggs Thayer)","Heikkinen, Miss. Laina","Futrelle, Mrs. Jacques Heath (Lily May Peel)","Allen, Mr. William Henry",...,"Montvila, Rev. Juozas","Graham, Miss. Margaret Edith","Johnston, Miss. Catherine Helen "Carrie"","Behr, Mr. Karl Howell","Dooley, Mr. Patrick"]]
Sex: [["male","female","female","female","male",...,"male","female","female","male","male"]]
Age: [[22,38,26,35,35,...,27,19,null,26,32]]
SibSp: [[1,1,0,1,0,...,0,0,1,0,0]]
Parch: [[0,0,0,0,0,...,0,0,2,0,0]]
Ticket: [["A/5 21171","PC 17599","STON/O2. 3101282","113803","373450",...,"211536","112053","W./C. 6607","111369","370376"]]
Fare: [[7.25,71.2833,7.925,53.1,8.05,...,13,30,23.45,30,7.75]]
...

In [24]:
titanic_pl_df.head()

shape: (5, 12)
┌─────────────┬──────────┬────────┬────────────────────────────────┬───┬──────────────────┬─────────┬───────┬──────────┐
│ PassengerId ┆ Survived ┆ Pclass ┆ Name                           ┆ … ┆ Ticket           ┆ Fare    ┆ Cabin ┆ Embarked │
│ ---         ┆ ---      ┆ ---    ┆ ---                            ┆   ┆ ---              ┆ ---     ┆ ---   ┆ ---      │
│ i64         ┆ i64      ┆ i64    ┆ str                            ┆   ┆ str              ┆ f64     ┆ str   ┆ str      │
╞═════════════╪══════════╪════════╪════════════════════════════════╪═══╪══════════════════╪═════════╪═══════╪══════════╡
│ 1           ┆ 0        ┆ 3      ┆ Braund, Mr. Owen Harris        ┆ … ┆ A/5 21171        ┆ 7.25    ┆ null  ┆ S        │
│ 2           ┆ 1        ┆ 1      ┆ Cumings, Mrs. John Bradley     ┆ … ┆ PC 17599         ┆ 71.2833 ┆ C85   ┆ C        │
│             ┆          ┆        ┆ (Flor…                         ┆   ┆                  ┆         ┆       ┆          │
│ 3           ┆ 1        ┆ 3      ┆ Heikkinen, Miss. Laina         ┆ … ┆ STON/O2. 3101282 ┆ 7.925   ┆ null  ┆ S        │
│ 4           ┆ 1        ┆ 1      ┆ Futrelle, Mrs. Jacques Heath   ┆ … ┆ 113803           ┆ 53.1    ┆ C123  ┆ S        │
│             ┆          ┆        ┆ (Li…                           ┆   ┆                  ┆         ┆       ┆          │
│ 5           ┆ 0        ┆ 3      ┆ Allen, Mr. William Henry       ┆ … ┆ 373450           ┆ 8.05    ┆ null  ┆ S        │
└─────────────┴──────────┴────────┴────────────────────────────────┴───┴──────────────────┴─────────┴───────┴──────────┘

In [25]:
titanic_pl_df['Age'].head()

shape: (10,)
Series: 'Age' [f64]
[
	22.0
	38.0
	26.0
	35.0
	35.0
	null
	54.0
	2.0
	27.0
	14.0
]

In [26]:
titanic_pl_df.select("Age").to_series().head(6)

shape: (6,)
Series: 'Age' [f64]
[
	22.0
	38.0
	26.0
	35.0
	35.0
	null
]

In [28]:
titanic_pl_df["Age"].to_frame().head(6)

shape: (6, 1)
┌──────┐
│ Age  │
│ ---  │
│ f64  │
╞══════╡
│ 22.0 │
│ 38.0 │
│ 26.0 │
│ 35.0 │
│ 35.0 │
│ null │
└──────┘

In [29]:
data = [10,20,30]
pl.Series(data)

shape: (3,)
Series: '' [i64]
[
	10
	20
	30
]

In [30]:
pl.Series('col1',data)

shape: (3,)
Series: 'col1' [i64]
[
	10
	20
	30
]

In [32]:
pl.Series('col1',data).to_list()

[10, 20, 30]

In [33]:
data = [[10,20,30],[100,200,300]]
pl.DataFrame(data)

shape: (3, 2)
┌──────────┬──────────┐
│ column_0 ┆ column_1 │
│ ---      ┆ ---      │
│ i64      ┆ i64      │
╞══════════╪══════════╡
│ 10       ┆ 100      │
│ 20       ┆ 200      │
│ 30       ┆ 300      │
└──────────┴──────────┘

In [34]:
data = [[10,20,30],[100,200,300]]
pl.DataFrame(data,schema=['col_1','col_2'])

shape: (3, 2)
┌───────┬───────┐
│ col_1 ┆ col_2 │
│ ---   ┆ ---   │
│ i64   ┆ i64   │
╞═══════╪═══════╡
│ 10    ┆ 100   │
│ 20    ┆ 200   │
│ 30    ┆ 300   │
└───────┴───────┘

In [35]:
dict_data = {"col_1":[10,20,30,40],
            "col_2":[100,200,300,400]}

pl.DataFrame(dict_data)

shape: (4, 2)
┌───────┬───────┐
│ col_1 ┆ col_2 │
│ ---   ┆ ---   │
│ i64   ┆ i64   │
╞═══════╪═══════╡
│ 10    ┆ 100   │
│ 20    ┆ 200   │
│ 30    ┆ 300   │
│ 40    ┆ 400   │
└───────┴───────┘

In [36]:
pl.DataFrame(dict_data,schema={"col_1":pl.Int64,"col_2":pl.Float64})

shape: (4, 2)
┌───────┬───────┐
│ col_1 ┆ col_2 │
│ ---   ┆ ---   │
│ i64   ┆ f64   │
╞═══════╪═══════╡
│ 10    ┆ 100.0 │
│ 20    ┆ 200.0 │
│ 30    ┆ 300.0 │
│ 40    ┆ 400.0 │
└───────┴───────┘

In [37]:
pl.DataFrame(dict_data,schema={"col_1":pl.Int64,"col_2":pl.Float64}).to_dicts()

[{'col_1': 10, 'col_2': 100.0},
 {'col_1': 20, 'col_2': 200.0},
 {'col_1': 30, 'col_2': 300.0},
 {'col_1': 40, 'col_2': 400.0}]

In [38]:
np_arr = titanic_pl_df.to_numpy()
np_arr

array([[1, 0, 3, ..., 7.25, None, 'S'],
       [2, 1, 1, ..., 71.2833, 'C85', 'C'],
       [3, 1, 3, ..., 7.925, None, 'S'],
       ...,
       [889, 0, 3, ..., 23.45, None, 'S'],
       [890, 1, 1, ..., 30.0, 'C148', 'C'],
       [891, 0, 3, ..., 7.75, None, 'Q']], dtype=object)

In [40]:
titanic_pl_df.select(pl.col(pl.Float64)).head()

shape: (5, 2)
┌──────┬─────────┐
│ Age  ┆ Fare    │
│ ---  ┆ ---     │
│ f64  ┆ f64     │
╞══════╪═════════╡
│ 22.0 ┆ 7.25    │
│ 38.0 ┆ 71.2833 │
│ 26.0 ┆ 7.925   │
│ 35.0 ┆ 53.1    │
│ 35.0 ┆ 8.05    │
└──────┴─────────┘

In [42]:
titanic_pl_df.glimpse()

Rows: 891
Columns: 12
$ PassengerId <i64> 1, 2, 3, 4, 5, 6, 7, 8, 9, 10
$ Survived    <i64> 0, 1, 1, 1, 0, 0, 0, 0, 1, 1
$ Pclass      <i64> 3, 1, 3, 1, 3, 3, 1, 3, 3, 2
$ Name        <str> Braund, Mr. Owen Harris, Cumings, Mrs. John Bradley (Florence Briggs Thayer), Heikkinen, Miss. Laina, Futrelle, Mrs. Jacques Heath (Lily May Peel), Allen, Mr. William Henry, Moran, Mr. James, McCarthy, Mr. Timothy J, Palsson, Master. Gosta Leonard, Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg), Nasser, Mrs. Nicholas (Adele Achem)
$ Sex         <str> male, female, female, female, male, male, male, male, female, female
$ Age         <f64> 22.0, 38.0, 26.0, 35.0, 35.0, None, 54.0, 2.0, 27.0, 14.0
$ SibSp       <i64> 1, 1, 0, 1, 0, 0, 0, 3, 0, 1
$ Parch       <i64> 0, 0, 0, 0, 0, 0, 0, 1, 2, 0
$ Ticket      <str> A/5 21171, PC 17599, STON/O2. 3101282, 113803, 373450, 330877, 17463, 349909, 347742, 237736
$ Fare        <f64> 7.25, 71.2833, 7.925, 53.1, 8.05, 8.4583, 51.8625, 21.075, 11.1333, 30.0708
$ Cabin       <str> None, C85, None, C123, None, None, E46, None, None, None
$ Embarked    <str> S, C, S, S, S, Q, S, S, S, C

In [44]:
np_arr = np.random.standard_normal((20,9))
pl.DataFrame(np_arr)

shape: (20, 9)
┌───────────┬───────────┬───────────┬───────────┬───┬───────────┬───────────┬───────────┬───────────┐
│ column_0  ┆ column_1  ┆ column_2  ┆ column_3  ┆ … ┆ column_5  ┆ column_6  ┆ column_7  ┆ column_8  │
│ ---       ┆ ---       ┆ ---       ┆ ---       ┆   ┆ ---       ┆ ---       ┆ ---       ┆ ---       │
│ f64       ┆ f64       ┆ f64       ┆ f64       ┆   ┆ f64       ┆ f64       ┆ f64       ┆ f64       │
╞═══════════╪═══════════╪═══════════╪═══════════╪═══╪═══════════╪═══════════╪═══════════╪═══════════╡
│ 0.842078  ┆ -0.743564 ┆ -0.414251 ┆ -0.527671 ┆ … ┆ -0.581116 ┆ 0.810875  ┆ -0.317421 ┆ 0.92333   │
│ 1.584556  ┆ 0.393231  ┆ -0.324836 ┆ -1.687817 ┆ … ┆ 0.391427  ┆ -0.581061 ┆ -0.745725 ┆ -0.420402 │
│ 1.452314  ┆ 1.060697  ┆ 1.954097  ┆ -0.17774  ┆ … ┆ 0.302126  ┆ 0.460381  ┆ 0.423654  ┆ 0.951511  │
│ 1.391898  ┆ -0.135494 ┆ -2.49187  ┆ -0.261944 ┆ … ┆ 0.193231  ┆ 0.207194  ┆ 1.393968  ┆ 0.769222  │
│ …         ┆ …         ┆ …         ┆ …         ┆ … ┆ …         ┆ …         ┆ …         ┆ …         │
│ -0.572284 ┆ -0.416234 ┆ -0.878168 ┆ -0.640256 ┆ … ┆ 0.227916  ┆ -0.968396 ┆ -2.190301 ┆ -0.456257 │
│ -1.275851 ┆ -0.686311 ┆ 0.121996  ┆ 0.912074  ┆ … ┆ 0.326475  ┆ -0.253569 ┆ 1.191834  ┆ 0.015579  │
│ -1.253664 ┆ 0.779316  ┆ -0.343618 ┆ -1.087754 ┆ … ┆ -0.457403 ┆ 0.162555  ┆ -1.623727 ┆ 0.384139  │
│ -1.106951 ┆ 1.684217  ┆ -0.760812 ┆ -0.552576 ┆ … ┆ 2.129316  ┆ -2.006817 ┆ -1.257621 ┆ -0.424687 │
└───────────┴───────────┴───────────┴───────────┴───┴───────────┴───────────┴───────────┴───────────┘

In [46]:
zero_arr = titanic_pl_df['Fare'].head().to_numpy(zero_copy_only=True)
zero_arr

array([ 7.25  , 71.2833,  7.925 , 53.1   ,  8.05  ,  8.4583, 51.8625,
       21.075 , 11.1333, 30.0708])

In [48]:
zero_arr[3] = 777

ValueError: assignment destination is read-only

In [51]:
zero_arr = titanic_pl_df['Fare'].head().to_numpy(zero_copy_only=False)
zero_arr

array([ 7.25  , 71.2833,  7.925 , 53.1   ,  8.05  ,  8.4583, 51.8625,
       21.075 , 11.1333, 30.0708])

In [52]:
zero_arr[3] = 777

ValueError: assignment destination is read-only

In [53]:
titanic_pl_df.to_pandas(use_pyarrow_extension_array=True).head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,<NA>,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,<NA>,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,<NA>,S

In [54]:
titanic_pl_df.to_pandas(use_pyarrow_extension_array=True).dtypes

PassengerId           int64[pyarrow]
Survived              int64[pyarrow]
Pclass                int64[pyarrow]
Name           large_string[pyarrow]
Sex            large_string[pyarrow]
Age                  double[pyarrow]
SibSp                 int64[pyarrow]
Parch                 int64[pyarrow]
Ticket         large_string[pyarrow]
Fare                 double[pyarrow]
Cabin          large_string[pyarrow]
Embarked       large_string[pyarrow]
dtype: object

# Indexing, slicing, filtering